class MusicalInstrument
{
    public static string name { get; protected set; }
    public static string description { get; protected set; }
    public static string history { get; protected set; }
    public static string sound { get; protected set; }

    public virtual void Sound()
    {
        Console.WriteLine($"Звук {name}:");
    }

    public void Show()
    {
        Console.WriteLine($"Назва: {name}");
    }

    public void Description()
    {
        Console.WriteLine($"Опис: {description}");
    }

    public void History()
    {
        Console.WriteLine($"Історія створення: {history}");
    }
}

class Violin : MusicalInstrument
{
    public Violin()
    {
        name = "Скрипка";
        description = "Інструмент має 4 струни. Скрипка складається з трьох частин. " +
            "На звучання інструменту впливають склад лаку, яким він покритий, і матеріал виготовлення.";
        history = "В середині XVI століття на півночі Італії і утворилася сучасна конструкція скрипки. " +
            "Аж до початку XVII століття виготовленням скрипок займалося сімейство Аматі в Італії. " +
            "Взагалі Італія зайняла лідируючі позиції по виготовленню якісних скрипок.";
    }

    public override void Sound()
    {
        Console.WriteLine("Звук скрипки: Скрипка видає витончений звук. Басові струни видають строгий звук. " +
            "Середні струни звучать м’яко. Верхній регістр струн звучить дзвінко.");
    }
}

class Trombone : MusicalInstrument
{
    public Trombone()
    {
        name = "Тромбон";
        description = "Трубка інструменту в основному циліндрична , але ближче до розтруба стає конусоподібною. " +
            "Мундштук має вигляд неглибокої кулястої чашки, схожої на мундштук великої труби, і відрізняється від мундштуків " +
            "інших мідних інструментів.";
        history = "Тромбон є одним з найдавніших музичних інструментів і виник у давні часи. " +
            "Сучасний тромбон, такий, як ми його знаємо, розвинувся в Європі в 15 столітті. " +
            "Винайдено їхнього зброєтворця ремісника Габріеля Креспі і вперше представлений у Венеції в 1495 році.";
    }

    public override void Sound()
    {
        Console.WriteLine("Звук тромбону: Звуковий колорит тромбона дуже багатий, він може бути мужнім, яскравим і грізним, " +
            "але може бути спокійним і ліричним, так, спочатку інструмент використовувався в церковних творах.");
    }
}

class Ukulele : MusicalInstrument
{
    public Ukulele()
    {
        name = "Укулеле";
        description = "Це струнний музичний інструмент, який викликає великий інтерес у багатьох музикантів через свою компактність, " +
            "легкість гри та яскравий, веселий звук. Цей інструмент найбільш популярний на Гаваях, де його стали символом культури.";
        history = "Історія створення укулеле почалася на Гаваях. Коли португальські іммігранти прибули на Гавайські острови, вони принесли з собою цей інструмент.";
    }

    public override void Sound()
    {
        Console.WriteLine("Звук укулеле: Можна охарактеризувати як яскравий, легкий і веселий. " +
            "Цей інструмент має характерний звук, який легко впізнати. " +
            "Основна причина такого звучання полягає в його конструкції та виборі матеріалів.");
    }
}

class Cello : MusicalInstrument
{
    public Cello()
    {
        name = "Віолончель";
        description = "Це струнний музичний інструмент, який входить до скрипкової родини і має вигляд великої, " +
            "прямокутної коробки з довгим грифом. Вона має чотири струни, налаштовані в октаву нижче, ніж струни скрипки. " +
            "Віолончель зазвичай грається, тримаючи її між колінами музиканта, а верхню частину інструмента підпирають на плече.";
        history = "Історія віолончелі почалася у 16 столітті у Італії. " +
            "Її розвиток був пов'язаний з популярністю інших струнних інструментів того часу, таких як віола да гамба. ";
    }

    public override void Sound()
    {
        Console.WriteLine("Звук віолончелі: Звук віолончелі можна охарактеризувати як емоційний і глибокий. " +
            "Віолончель має широкий діапазон тонів, що дозволяє їй виразно передавати різні настрої і емоції. " +
            "Звук віолончелі часто порівнюють з людським голосом через його виразність і емоційну сили.");
    }
}